#include"c8051f330.h"
#include"led.h"
#include"alarm_level.h"
#include"timer.h"
u16 LED_cnt=0;
//-------------------------------------------------
//报警指示灯IO口初始化
//-------------------------------------------------
void Led_Init(void)
{ 
   P0SKIP  |= Pin_4 + Pin_6 + Pin_7; //对应的被交叉开关跳过
}
//-------------------------------------------------
//不报警指示灯控制
//-------------------------------------------------
void No_Led(void)
{
	 LED=1;							//低级报警指示灯灭
	 MLED=1;						//中级报警指示灯灭
	 HLED=1;						//高级报警指示灯灭
}
//-------------------------------------------------
//低级报警指示灯控制
//-------------------------------------------------
void Low_Led(void)
{
	 LED=0;					       //低级报警指示灯长亮
	 MLED=1;
	 HLED=1;
}
//-------------------------------------------------
//中级报警指示灯控制
//-------------------------------------------------
void Mid_Led(void)
{
	LED=1;
	HLED=1;
	LED_cnt++;
	if(LED_cnt==1000)             //中级报警指示灯闪烁频率0.5Hz，占空比50%
	{
		MLED=~MLED;
		LED_cnt=0;
	}
}
//-------------------------------------------------
//高级报警指示灯控制
//-------------------------------------------------
void High_Led(void)
{
	LED=1;
	MLED=1;
	LED_cnt++;
	if(LED_cnt>250)				  //中级报警指示灯闪烁频率2Hz，占空比50%
	{
	    HLED=~HLED;	
		LED_cnt=0;
	}
}
