/*
  *****************************************************************************
* Project:Alarm System of 2000A Ventilator（HVG2000C-B REV20-2009.8.5）
* Version:V0.1
* Data:2013.11.26
* Author:Li Huaqiang of Zhuhai Hokai Medical Instruments Co., Ltd.
* Copyright@2013 China Hokai All Rights Reserved 
  *****************************************************************************
* 根据标准YY0709-2009取值：
* 低级报警：tr=tf=20ms,td=200ms,tb=15.04s,y=200ms,音调e,c周期Te=3ms,Tc=3.8ms
* 中级报警：tr=tf=20ms,td=200ms,tb= 5.04s,y=200ms,音调c,a,f周期Tc=3.8ms,Ta=2.2ms,Tf=2.8ms
* 高级报警：tr=tf=20ms,td=150ms,tb= 3.04s,x=100ms,2x+td=350ms,
            第5和第6脉冲间时间间隔t6-t5=0.84s,音调c,a,f周期Tc=3.8ms,Ta=2.2ms,Tf=2.8ms
  *****************************************************************************
*/
#include"c8051f330.h"
#include"timer.h"
#include"dac.h"
#include"alarm_level.h"
#include"led.h"
//-----------------------------------------------------------------------------
//系统时钟初始化
//-----------------------------------------------------------------------------
//
void SYSCLK_Init (void)
{

   OSCICN = 0x83;                         // 系统时钟初始化为片内的 24.5MHz                 
                                         
   RSTSRC = 0x04;                         // 使能时钟丢失检测器
}
//-----------------------------------------------------------------------------
//主函数
//-----------------------------------------------------------------------------
//
int main(void)
{
	PCA0MD &= ~0x40;                      //禁止看门狗定时器
	SYSCLK_Init ();	                      //系统时钟设置
	InputIO_Init();						  //报警级别，音量级别数字信号输入
	Led_Init();							  //报警灯初始化
	DAC0_Init();						  //IDAC初始化
 	Timer2_Init (24500);                  //1ms中断
	Timer3_Init (2450);                   // 24500000/SAMPLE_RATE=100us 定时器3溢出作为DAC的转换启动信号
	EA = 1;							      // 总中断使能
	for(;;)                               //主循环
	{
	    
	}
}